УРВ_файловая/src/InformationRegisters/НастройкиИнтеграции/НастройкиИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграции</name>
  <resources>
    <name>АдресПодключения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сервер</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Интеграция</name>
    <type>
      <types>EnumRef.Интеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/СтавкиСотрудниковПоВидамРабот/СтавкиСотрудниковПоВидамРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиСотрудниковПоВидамРабот</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Enums/НастройкиУведомлений/НастройкиУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиУведомлений</name>
  <enumValues>
    <name>СрокУведомления</name>
  </enumValues>
  <enumValues>
    <name>ЧастотаУведомления</name>
  </enumValues>
  <enumValues>
    <name>Подписка</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/Documents/Обращение/Обращение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Обращение</name>
  <registerRecords>AccumulationRegister.ЗначенияПоказателей</registerRecords>
  <registerRecords>InformationRegister.ГолосаПользователейЗаПожелания</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияОбращений</registerRecords>
  <attributes>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентОбслуживающейОрганизации</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляПереписки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.КаналыПолученияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаБазыЗнаний</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.КомпонентыСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПрикрепилКарточку</name>
    <comment>Пользователь, который прикрепил к обращению карточку базы знаний</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСокращенный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжиданиеОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпискаНаТариф</name>
    <type>
      <types>DocumentRef.Подписка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученНовыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннееОбращение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнутренними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнешними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОбращенияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеОбращения</name>
    <attributes>
      <name>Обращение</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Catalogs/Работы/Работы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Работы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляТабеля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>EnumRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отсутствие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетУказанияКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УРВ_файловая/src/CommonModules/УРВСервер/Module.bsl
Функция НайтиОсновнойЭтапДляПодстановкиВДокументы(Владелец) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроектов КАК ЭтапыПроектов
		|ГДЕ
		|	ЭтапыПроектов.Владелец = &Владелец
		|	И НЕ ЭтапыПроектов.ПометкаУдаления
		|	И НЕ ЭтапыПроектов.Неактуальный";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий(); 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.ЭтапыПроектов.ПустаяСсылка();
	КонецЕсли;	
		
КонецФункции

Функция ПолучитьНастройкиИнтеграции(Интеграция) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИнтеграции.АдресПодключения КАК АдресПодключения,
		|	НастройкиИнтеграции.Пользователь КАК Пользователь,
		|	НастройкиИнтеграции.Пароль КАК Пароль,
		|	НастройкиИнтеграции.Сервер КАК Сервер,
		|	НастройкиИнтеграции.ИмяБазы КАК ИмяБазы
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграции КАК НастройкиИнтеграции
		|ГДЕ
		|	НастройкиИнтеграции.Интеграция = &Интеграция";
	
	Запрос.УстановитьПараметр("Интеграция", Интеграция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Структура = Неопределено;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Структура = Новый Структура;
		Структура.Вставить("АдресПодключения", ВыборкаДетальныеЗаписи.АдресПодключения);
		Структура.Вставить("Пользователь", ВыборкаДетальныеЗаписи.Пользователь);
		Структура.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
		Структура.Вставить("Сервер", ВыборкаДетальныеЗаписи.Сервер);
		Структура.Вставить("ИмяБазы", ВыборкаДетальныеЗаписи.ИмяБазы);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции	

Процедура ПередЗаписьюУстановкаОтветственногоПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Метаданные().Реквизиты.Найти("Ответственный") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Источник.Ответственный) ИЛИ Источник.Модифицированность() Тогда
			Источник.Ответственный = ТекущийПользователь;
		КонецЕсли;
	Исключение
		Сообщить("Ошибка установки реквизита ""Ответственный"": " + Символы.ПС + ОписаниеОшибки());
	КонецПопытки
	
КонецПроцедуры

Функция ПолучитьОбращенияКонтрагента(Абонент) Экспорт
	
	МассивОбращений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обращение.Дата КАК ДатаРегистрации,
		|	Обращение.ТипОбращения КАК ТипОбращения,
		|	Обращение.НомерСокращенный КАК НомерСокращенный,
		|	Обращение.КаналПолучения КАК КаналПолучения,
		|	Обращение.Тема КАК Тема,
		|	Обращение.Описание КАК Описание,
		|	Обращение.Состояние КАК Состояние,
		|	Обращение.Оценка КАК Оценка,
		|	Обращение.Инициатор КАК Инициатор,
		|	Обращение.Исполнитель КАК Исполнитель,
		|	Обращение.ДатаЗакрытия КАК ДатаЗакрытия
		|ИЗ
		|	Документ.Обращение КАК Обращение
		|ГДЕ
		|	Обращение.Абонент = &Абонент
		|	И НЕ Обращение.ПометкаУдаления
		|	И Обращение.Проведен";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивОбращений;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураОбращения = Новый Структура;
	    Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
	        СтруктураОбращения.Вставить(Колонка.Имя,Строка(ВыборкаДетальныеЗаписи[Колонка.Имя]));
	    КонецЦикла;
		МассивОбращений.Добавить(СтруктураОбращения);
	КонецЦикла;
	
	Возврат МассивОбращений;
	
КонецФункции	

Функция ЗаполнитьСписокВыборкаВидовРабот(Сотрудник, Дата) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(СтавкиСотрудниковПоВидамРаботСрезПоследних.Период) КАК Период,
	                      |	СтавкиСотрудниковПоВидамРаботСрезПоследних.Подразделение КАК Подразделение,
	                      |	СтавкиСотрудниковПоВидамРаботСрезПоследних.Регион КАК Регион,
	                      |	СтавкиСотрудниковПоВидамРаботСрезПоследних.Должность КАК Должность
	                      |ПОМЕСТИТЬ ВТ_ПоследнийДокументПоСтавке
	                      |ИЗ
	                      |	РегистрСведений.СтавкиСотрудниковПоВидамРабот.СрезПоследних(&датаСреза, ) КАК СтавкиСотрудниковПоВидамРаботСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	СтавкиСотрудниковПоВидамРаботСрезПоследних.Регион,
	                      |	СтавкиСотрудниковПоВидамРаботСрезПоследних.Должность,
	                      |	СтавкиСотрудниковПоВидамРаботСрезПоследних.Подразделение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СтавкиСотрудниковПоВидамРабот.ВидРаботы,
	                      |	СтавкиСотрудниковПоВидамРабот.Должность,
	                      |	СтавкиСотрудниковПоВидамРабот.Подразделение,
	                      |	СтавкиСотрудниковПоВидамРабот.Регион,
	                      |	СтавкиСотрудниковПоВидамРабот.Ставка,
	                      |	СтавкиСотрудниковПоВидамРабот.Оклад
	                      |ПОМЕСТИТЬ ВТ_Ставки
	                      |ИЗ
	                      |	ВТ_ПоследнийДокументПоСтавке КАК ВТ_ПоследнийДокументПоСтавке
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиСотрудниковПоВидамРабот КАК СтавкиСотрудниковПоВидамРабот
	                      |		ПО ВТ_ПоследнийДокументПоСтавке.Период = СтавкиСотрудниковПоВидамРабот.Период
	                      |			И ВТ_ПоследнийДокументПоСтавке.Подразделение = СтавкиСотрудниковПоВидамРабот.Подразделение
	                      |			И ВТ_ПоследнийДокументПоСтавке.Регион = СтавкиСотрудниковПоВидамРабот.Регион
	                      |			И ВТ_ПоследнийДокументПоСтавке.Должность = СтавкиСотрудниковПоВидамРабот.Должность
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	Работы.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Работы КАК Работы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ставки КАК ВТ_Ставки
	                      |		ПО Работы.ВидыРабот = ВТ_Ставки.ВидРаботы
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА Работы.ВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыРабот.РегламентированнаяРабота)
	                      |				ТОГДА ВТ_Ставки.Должность = &Должность
	                      |						И ВТ_Ставки.Подразделение = &Подразделение
	                      |						И ВТ_Ставки.Регион = &Регион
	                      |						И (ЕСТЬNULL(ВТ_Ставки.Ставка, 0) > 0
	                      |							ИЛИ ЕСТЬNULL(ВТ_Ставки.Оклад, 0) > 0)
	                      |			КОГДА Работы.ВидРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыРабот.ОкладнаяРабота)
	                      |				ТОГДА ВТ_Ставки.Должность = &Должность
	                      |						И ВТ_Ставки.Подразделение = &Подразделение
	                      |						И ВТ_Ставки.Регион = &Регион
	                      |						И ЕСТЬNULL(ВТ_Ставки.Оклад, 0) > 0
	                      |			ИНАЧЕ Работы.ВидРаботы <> ЗНАЧЕНИЕ(Перечисление.ВидыРабот.РегламентированнаяРабота)
	                      |		КОНЕЦ
	                      |	И НЕ Работы.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	
	СтруктураПараметров = Документы.УчетФактическихДанных.ТекущиеДанныеПоСотруднику(Сотрудник, ?(Дата = Дата(1,1,1), ТекущаяДата(), Дата));
	
	Запрос.УстановитьПараметр("Должность"     	, СтруктураПараметров.ТекущаяДолжность);
	Запрос.УстановитьПараметр("Подразделение" 	, СтруктураПараметров.ТекущееПодразделение);
	Запрос.УстановитьПараметр("Регион" 			, СтруктураПараметров.ТекущийРегион);
	Запрос.УстановитьПараметр("ДатаСреза"     	, ?(Дата = Дата(1,1,1), Текущаядата(), Дата));	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

//++kruser 20.05.2019 86294
Процедура ОтправитьУведомлениеОНеуспешномВыполненииРегламентногоЗаданияПолученияПочты() Экспорт 
	
	УчетнаяЗапись 	= Константы.АдресПочтыДляОтправкиНеуспешнойЗагрузкиПочты.Получить();
	Интервал 		= Константы.ИнтервалНапоминанияНеуспешнойЗагрузкиПочты.Получить();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) И Интервал > 0 Тогда
		
		Адресаты = Новый Массив;
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУведомлений.Пользователь КАК Пользователь,
		|	НастройкиУведомлений.Настройка КАК Настройка,
		|	НастройкиУведомлений.ВидСобытия КАК ВидСобытия,
		|	НастройкиУведомлений.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_НастройкиУведомлений
		|ИЗ
		|	РегистрСведений.НастройкиУведомлений КАК НастройкиУведомлений
		|ГДЕ
		|	НастройкиУведомлений.Настройка = ЗНАЧЕНИЕ(Перечисление.НастройкиУведомлений.Подписка)
		|	И НастройкиУведомлений.ВидСобытия = ЗНАЧЕНИЕ(Справочник.ВидыБизнесСобытий.НапоминаниеНеуспешнойЗагрузкиПочтыРарус)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПользователиКонтактнаяИнформация.Представление КАК Представление,
		|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	ПользователиКонтактнаяИнформация.Ссылка.Представление КАК ПредставлениеПользователя
		|ИЗ
		|	ВТ_НастройкиУведомлений КАК ВТ_НастройкиУведомлений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО ВТ_НастройкиУведомлений.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
		|	И ПользователиКонтактнаяИнформация.АдресЭП <> """"";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Адресаты.Добавить(Новый Структура("Адрес, Представление", ВыборкаДетальныеЗаписи.АдресЭП, ВыборкаДетальныеЗаписи.ПредставлениеПользователя));
		КонецЦикла;
				
		Если Адресаты.Количество() > 0 Тогда
						
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДатыПоследнейЗагрузкиПочтовыхСообщений.УчетнаяЗапись КАК УчетнаяЗапись,
			|	ДатыПоследнейЗагрузкиПочтовыхСообщений.УчетнаяЗапись.Представление КАК УчетнаяЗаписьПредставление,
			|	ДатыПоследнейЗагрузкиПочтовыхСообщений.ДатаЗагрузкиПисем КАК ДатаЗагрузкиПисем
			|ИЗ
			|	РегистрСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений КАК ДатыПоследнейЗагрузкиПочтовыхСообщений
			|ГДЕ
			|	&Интервал > 0
			|	И РАЗНОСТЬДАТ(ДатыПоследнейЗагрузкиПочтовыхСообщений.ДатаЗагрузкиПисем, &ТекущаяДата, МИНУТА) >= &Интервал";
			
			Запрос.УстановитьПараметр("Интервал", 		Интервал);
			Запрос.УстановитьПараметр("ТекущаяДата", 	ТекущаяДатаСеанса());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ТелоПисьма = Неопределено;
			Тема = "Не работает загрузка писем!";
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТелоПисьма = ?(ЗначениеЗаполнено(ТелоПисьма), ТелоПисьма + Символы.ПС + ВыборкаДетальныеЗаписи.УчетнаяЗаписьПредставление + Формат(ВыборкаДетальныеЗаписи.ДатаЗагрузкиПисем, "ДФ=': dd.MM.yyyy HH:mm:ss'"), ВыборкаДетальныеЗаписи.УчетнаяЗаписьПредставление + Формат(ВыборкаДетальныеЗаписи.ДатаЗагрузкиПисем, "ДФ=': dd.MM.yyyy HH:mm:ss'")); 
			КонецЦикла;
			
			Если Не ТелоПисьма = Неопределено Тогда
				
				ТелоПисьма = "С момента последней успешной загрузки писем по одной или нескольким учётным записям прошло более " 
					+ Строка(Интервал) + " мин. Даты и время последних успешных загрузок по учётным записям: " 
					+ Символы.ПС + ТелоПисьма + Символы.ПС 
					+ "Необходима проверка параметров функционирования системы."; 
				
				ПараметрыПисьма = Новый Структура;
				
				ПараметрыПисьма.Вставить("Кому", 				Адресаты);
				ПараметрыПисьма.Вставить("Тема", 				Тема);
				ПараметрыПисьма.Вставить("Тело", 				ТелоПисьма);
				ПараметрыПисьма.Вставить("Важность",  			УправлениеЭлектроннойПочтой.ПолучитьВажность(Перечисления.ВариантыВажностиВзаимодействия.Обычная));
				ПараметрыПисьма.Вставить("ТипТекста", 			Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
				ПараметрыПисьма.Вставить("ОбрабатыватьТексты", 	Ложь);

				СоотвВложения = Новый Соответствие;				
				ПараметрыПисьма.Вставить("Вложения", СоотвВложения);
								
				Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись);
				
				Попытка
					
					Соединение = Новый ИнтернетПочта;
					ПротоколПодключения = ?(ПустаяСтрока(Профиль.АдресСервераIMAP), ПротоколИнтернетПочты.POP3, ПротоколИнтернетПочты.IMAP);
					Соединение.Подключиться(Профиль, ПротоколПодключения);
					
					Если ПротоколПодключения = ПротоколИнтернетПочты.IMAP Тогда
						ПочтовыеЯщики = Соединение.ПолучитьПочтовыеЯщики();
						Для Каждого ПочтовыйЯщик Из ПочтовыеЯщики Цикл
							Если НРег(ПочтовыйЯщик) = "отправленные"
								Или НРег(ПочтовыйЯщик) = "sent" Тогда
								
								Соединение.ТекущийПочтовыйЯщик = ПочтовыйЯщик;
								
							КонецЕсли;
						КонецЦикла;
						
						ПротоколПочты = "";

					Иначе
						ПротоколПочты = "";
					КонецЕсли;
					
					ТребуетсяПереустановкаСоединения = Ложь;
					
				Исключение
					
					ТребуетсяПереустановкаСоединения = Истина;
					
					ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Во время подключения к учетной записи %1 произошла ошибка
					|%2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УчетнаяЗапись,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					ЗаписьЖурналаРегистрации(УправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка, , ,
					ТекстСообщенияОбОшибке);
					
				КонецПопытки;
				
				Если Не ТребуетсяПереустановкаСоединения Тогда
					
					Попытка
						
						Если ПротоколПочты = "" Или ПротоколПочты = "IMAP" Тогда
							Если ПротоколПочты = "IMAP" Тогда
								ПараметрыПисьма.Вставить("ПротоколПочты","IMAP");
							КонецЕсли;
							ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма, Соединение, ПротоколПочты);
						ИначеЕсли ПротоколПочты = "Все" Тогда
							ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма, Соединение, "");
							ПараметрыПисьма.Вставить("ПротоколПочты","IMAP");
							РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма, Соединение, "IMAP");
						КонецЕсли;
						
					Исключение
												
						Если ТипЗнч(ПараметрыПисьма) = Тип("Структура") И ПараметрыПисьма.Свойство("ОшибочныеПолучатели") Тогда
							
						Иначе
							ЭтоПроблемаОтвергнутыхСерверомПочтовыхАдресов = Ложь;
							ВсеАдресатыПисьмаОтвергнутыСервером           = Ложь;
						КонецЕсли;
						
						Если ЭтоПроблемаОтвергнутыхСерверомПочтовыхАдресов 
							И Не ВсеАдресатыПисьмаОтвергнутыСервером Тогда
							
							ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Следующие адресаты электронного письма %1 не приняты почтовым сервером:
							|%2. Письмо отправлено остальным адресатам.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),,);
							
						Иначе
							
							ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Во время отправки электронного письма %1 произошла ошибка
							|%2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),,
							ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
						КонецЕсли;
						
						ЗаписьЖурналаРегистрации(УправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
						УровеньЖурналаРегистрации.Ошибка, , ,
						ТекстСообщенияОбОшибке);
						
					КонецПопытки;	
					
					Соединение.Отключиться();
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
//--kruser 20.05.2019 86294

//{Рарус kruser 06.06.2019 87760
&НаСервере
Функция ПроверитьДоступностьРолиКлиентКомпании() Экспорт

	Возврат РольДоступна("КлиентКомпании");

КонецФункции 
//}Рарус kruser 06.06.2019 87760
